import React from 'react';
import Header from '../../components/Header';

function AboutPage() {
  return (
    <div>
      <Header />
      <div>
        저는 좋아하는 게 많습니다. 자유로운 여행, 진지한 영화, 몰입감 좋은 책,
        여러 나라의 역사, 인디 음악, 맛있는 음식과 잘 어울리는 술, 백엔드 개발,
        최근에는 서비스 기획까지! ~~(tmi)~~ 이 중에는 취미도 있고 저의
        '분야'라고 부를 수 있는 것도 있습니다. 개수, 종류와 상관없이 사람들은
        취미나 관심사를 가지고 있는 경우가 많아요. <br />
        ***여러 가지 모습으로 삶을 다채롭게 살고 싶다.***
        <br /> 저는 이런 생각을 꽤 자주 하는데 정작 돌아보니 어떤 활동을 했는지
        정리하기가 힘들었습니다. 분명 매일 무언가를 하고 일상 안에서 나는 여러
        모습으로 존재하는데 말이죠. 꼭 중요한 일이 아니더라도 우리는 매일을
        알차게 보내고 있을 겁니다.
        <br /> 그럼 물음 한 번 더, ***왜 어떤 활동을 했는지 알아야 할까?***
        <br />
        무엇에 시간과 에너지를 쏟았는지 알 수 있다면 나의 관심의 흐름을 파악할
        수 있습니다. 그러다 보면 내가 하고싶은 일의 방향을 찾는 것에도 도움이 될
        수 있다고 생각했어요. (취미였다가 나중엔 커리어가 될 지도 모르는 일!)
        또, 여유가 없어서 잊고 지냈던 것들을 다시 끄집어내는 데에는 시간이 많이
        걸리는 경우도 종종 있습니다. 한때 좋아했던 것을 까먹는 건 조금 슬프지
        않나요. 하다 말았던, 맘 속으론 시작했지만 그렇지 못했던 활동들을 다시
        이끌어낼 수 있으면 좋겠습니다.
      </div>
    </div>
  );
}

export default AboutPage;
