export const questionToType: {
  [k: string]: '성실성' | '개방성' | '외향성' | '우호성';
} = {
  '1': '성실성',
  '2': '개방성',
  '3': '외향성',
  '4': '우호성',
  '5': '개방성',
  '6': '성실성',
  '7': '외향성',
  '8': '우호성',
  '9': '성실성',
  '10': '외향성',
  '11': '개방성',
  '12': '우호성',
};

export const answerToCatchu = {
  AAAA: {
    name: '찰칵- 멋진 곳만 골라 출사 다니는 포토그래퍼',
  },
  AAAB: {
    name: '크루들과 함께 도심 속 달리기, 시티 러너',
  },
  AABA: {
    name: '한 걸음 한 걸음, 나를 찾는 길을 걷는 트래킹족',
  },
  AABB: {
    name: '오르지 못한 절벽은 없어! 마운틴 클라이머',
  },
  ABAA: {
    name: '내 안의 아이돌을 꺼내봐! 둠칫둠칫 댄서',
  },
  ABAB: {
    name: '차곡차곡 도장깨기를 해볼까? 스트리트 푸드 파이터!',
  },
  ABBA: {
    name: '혼자 봤던 풍경들이 고스란히 남기를, 여행 브이로거',
  },
  ABBB: {
    name: '무럭무럭 키워서 맛있게 먹어버리겠다! 텃밭 가꾸는 농부',
  },
  BAAA: {
    name: '빠른 두뇌회전으로 체스를 두는 퀸즈갬빗, 아니 캐츄갬빗?',
  },
  BAAB: {
    name: '싸늘하다... 가슴에 비수가 날ㅇ...! 보드 게임을 지배하는 게이머',
  },
  BABA: {
    name: '정성 한 그릇을 손 끝으로 빚어내는 도예가',
  },
  BABB: {
    name: '맛있는 건 정말 참을 수 없어~ 집밥 캐선생',
  },
  BBAA: {
    name: '브레인스토밍과 썰전은 참을 수 없지, 독서 모임 우수 회원',
  },
  BBAB: {
    name: '교양 충전, 환상의 하모니를 연주하는 오케스트라 단원',
  },
  BBBA: {
    name: '나만의 세계를 써내려가는 작가, 조앤 캐츄 롤링?',
  },
  BBBB: {
    name: '한 땀마다 따숩게, 겨울을 기다리는 뜨개질 마스터',
  },
};
